arslanalperen/Labs/Source/stm32g0-main/PROJE_2/BSP.c
	    /* Select the main PLL as system clock source, (CFGR:bits 1:0)
	     * 0b00 - HSI
	     * 0b01 - HSE
	     * 0b10 - PLL
	     */
	    RCC->CFGR &= ~(3U << 0);
	    RCC->CFGR |=  (2  << 0);
	    /* Wait till the main PLL is used as system clock source (CFGR:bits 3:2) */
	    while (!(RCC->CFGR & (2 << 2)));

	    SystemCoreClock = 64000000;

}








/*
void EXTI4_15IRQHandler(void){


}
*/



void configure_A0_int(){/*
	RCC-> APBENR2 |= (1U << 0); //enable SYSCFG clock
	EXTI-> EXTICR[0] |= (0U << 8*0); //chose port A (0. port) and 0th pin  (8*0)

	 EXTI->RTSR1 |= (1U << 0);//chose falling edge trigger at A0 (0th pin, so shift 0 bits to the left)

	    EXTI->IMR1 |= (1U << 0);  // Mask pin 0


	      NVIC_SetPriority(EXTI0_1_IRQn,1);
	      NVIC_EnableIRQ(EXTI0_1_IRQn);
*/
}


/*SYSTICK functions*/

void SysTick_Handler(void)
{
    if (tDelay != 0)
    {
        tDelay--;
    }

}

void init_systick(uint32_t s){

    // Clear CTRL register
    SysTick->CTRL = 0x00000;
    // Main clock source is running with HSI by default which is at 8 Mhz.
    // SysTick clock source can be set with CTRL register (Bit 2)
    // 0: Processor clock/8 (AHB/8)
    // 1: Processor clock (AHB)
    SysTick->CTRL |= (1 << 2);
    // Enable callback (bit 1)
    SysTick->CTRL |= (1 << 1);
    // Load the value
    SysTick->LOAD = (uint32_t)(s-1);
    // Set the current value to 0
    SysTick->VAL = 0;
    // Enable SysTick (bit 0)
    SysTick->CTRL |= (1 << 0);
}


void delay_ms(uint32_t s)
{
    tDelay = s;
    while(tDelay != 0);


}

/*SSD functions*/
void init_SSD(){
	/*configure 7 segment pins*/
	setMode('A',8,'O');
	setMode('A',4,'O');
	setMode('A',5,'O');
	setMode('A',12,'O');
	setMode('A',6,'O');
	setMode('A',7,'O');
	setMode('A',11,'O');

	setMode('B',4,'O');
	setMode('B',5,'O');
	setMode('B',8,'O');
	setMode('B',9,'O');



	//set ssd digits high as initial to close all digits
	GPIOA->ODR |= (1U << 11);	//set  a5
	GPIOA->ODR |= (1U << 12);	//set  a4
	GPIOA->ODR |= (1U << 5);	//set  a3
	GPIOB->ODR |= (1U << 9);	//set  d10
}



void print_digit(volatile uint32_t dig)//SSD digit print function
{


	switch (dig){

	case 0:
		GPIOB->ODR |= (1U << 4);	//set  d12
		GPIOB->ODR |= (1U << 5);	//set  d11
		GPIOA->ODR |= (1U << 8);	//set  d9
		GPIOA->ODR |= (1U << 4);	//set  a2
		GPIOA->ODR |= (1U << 6);	//set  a6
		GPIOA->ODR |= (1U << 7);	//set  a7


		GPIOB->ODR &= ~(1U << 8);	//set  d8

		break;
	case 1:
		GPIOA->ODR |= (1U << 8);	//set  d9
		GPIOA->ODR |= (1U << 4);	//set  a2

		GPIOB->ODR &= ~(1U << 4);	//set  d12
		GPIOB->ODR &= ~(1U << 5);	//set  d11
		GPIOB->ODR &= ~(1U << 8);	//set  d8
		GPIOA->ODR &= ~(1U << 6);	//set  a6
		GPIOA->ODR &= ~(1U << 7);	//set  a7

		break;
	case 2:
		GPIOB->ODR |= (1U << 4);	//set  d12
		GPIOB->ODR |= (1U << 5);	//set  d11
		GPIOB->ODR |= (1U << 8);	//set  d8
		GPIOA->ODR |= (1U << 4);	//set  a2
		GPIOA->ODR |= (1U << 7);	//set  a7


		GPIOA->ODR &= ~(1U << 8);	//set  d9
		GPIOA->ODR &= ~(1U << 6);	//set  a6

		break;
	case 3:
		GPIOB->ODR |= (1U << 5);	//set  d11
		GPIOA->ODR |= (1U << 8);	//set  d9
		GPIOB->ODR |= (1U << 8);	//set  d8
		GPIOA->ODR |= (1U << 4);	//set  a2
		GPIOA->ODR |= (1U << 7);	//set  a7

		GPIOB->ODR &= ~(1U << 4);	//reset  d12
		GPIOA->ODR &= ~(1U << 6);	//reset  a6


		break;
	case 4:
		GPIOA->ODR |= (1U << 8);	//set  d9
		GPIOB->ODR |= (1U << 8);	//set  d8
		GPIOA->ODR |= (1U << 4);	//set  a2
		GPIOA->ODR |= (1U << 6);	//set  a6

		GPIOB->ODR &= ~(1U << 4);	//reset  d12
		GPIOB->ODR &= ~(1U << 5);	//reset  d11
		GPIOA->ODR &= ~(1U << 7);	//reset  a7

		break;
	case 5:
		GPIOB->ODR |= (1U << 5);	//set  d11
		GPIOA->ODR |= (1U << 8);	//set  d9
		GPIOB->ODR |= (1U << 8);	//set  d8
		GPIOA->ODR |= (1U << 6);	//set  a6
		GPIOA->ODR |= (1U << 7);	//set  a7

		GPIOB->ODR &= ~(1U << 4);	//reset  d12
		GPIOA->ODR &= ~(1U << 4);	//reset  a2


		break;
	case 6:
		GPIOB->ODR |= (1U << 4);	//set  d12
		GPIOB->ODR |= (1U << 5);	//set  d11
		GPIOA->ODR |= (1U << 8);	//set  d9
		GPIOB->ODR |= (1U << 8);	//set  d8
		GPIOA->ODR |= (1U << 6);	//set  a6
		GPIOA->ODR |= (1U << 7);	//set  a7

		GPIOA->ODR &= ~(1U << 4);	//reset  a2


		break;
	case 7:
		GPIOA->ODR |= (1U << 8);	//set  d9
		GPIOA->ODR |= (1U << 4);	//set  a2
		GPIOA->ODR |= (1U << 6);	//set  a6
		GPIOA->ODR |= (1U << 7);	//set  a7

		GPIOB->ODR &= ~(1U << 4);	//reset  d12
		GPIOB->ODR &= ~(1U << 5);	//reset  d11
		GPIOB->ODR &= ~(1U << 8);	//reset  d8

		break;
	case 8:
		GPIOB->ODR |= (1U << 4);	//set  d12
		GPIOB->ODR |= (1U << 5);	//set  d11
		GPIOA->ODR |= (1U << 8);	//set  d9
		GPIOB->ODR |= (1U << 8);	//set  d8
		GPIOA->ODR |= (1U << 4);	//set  a2
		GPIOA->ODR |= (1U << 6);	//set  a6
		GPIOA->ODR |= (1U << 7);	//set  a7

		break;
	case 9:
		GPIOB->ODR |= (1U << 5);	//set  d11
		GPIOA->ODR |= (1U << 8);	//set  d9
		GPIOB->ODR |= (1U << 8);	//set  d8
		GPIOA->ODR |= (1U << 4);	//set  a2
		GPIOA->ODR |= (1U << 6);	//set  a6
		GPIOA->ODR |= (1U << 7);	//set  a7

		GPIOB->ODR &= ~(1U << 4);	//reset  d12

		break;

	case 10: //letter for enter key (#)

		GPIOB->ODR |= (1U << 5);	//set  d11
		GPIOA->ODR |= (1U << 8);	//set  d9
		GPIOB->ODR |= (1U << 8);	//set  d8
		GPIOA->ODR |= (1U << 4);	//set  a2
		GPIOA->ODR |= (1U << 7);	//set  a

		GPIOA->ODR &= ~(1U << 6);	//set  a6
		GPIOB->ODR &= ~(1U << 4);	//reset  d12

		break;

	case 11: //letter A
		GPIOB->ODR |= (1U << 4);	//set  d12
		GPIOA->ODR |= (1U << 4);	//set  a2
		GPIOA->ODR |= (1U << 6);	//set  a6
		GPIOA->ODR |= (1U << 7);	//set  a7
		GPIOB->ODR |= (1U << 8);	//set  d8
		GPIOA->ODR |= (1U << 8);	//set  d9

		GPIOB->ODR &= ~(1U << 5);	//set  d11

			break;
	case 12://letter c



		GPIOA->ODR &= ~(1U << 7);	//set  a
		GPIOA->ODR &= ~(1U << 4);	//set  b
		GPIOA->ODR &= ~(1U << 8);	//set  c
		GPIOB->ODR |= (1U << 5);	//set  d
		GPIOB->ODR |= (1U << 4);	//set  e
		GPIOA->ODR &= ~(1U << 6);	//set  f
		GPIOB->ODR |= (1U << 8);	//set  g

		break;

	case 13: // letter E

			GPIOA->ODR |= (1U << 7);	//set  a
			GPIOA->ODR &= ~(1U << 4);	//set  b
			GPIOA->ODR &= ~(1U << 8);	//set  c
			GPIOB->ODR |= (1U << 5);	//set  d
			GPIOB->ODR |= (1U << 4);	//set  e
			GPIOA->ODR |= (1U << 6);	//set  f
			GPIOB->ODR |= (1U << 8);	//set  g

			break;

		case 14: //letter n

			GPIOA->ODR &= ~(1U << 7);	//set  a
			GPIOA->ODR &= ~(1U << 4);	//set  b
			GPIOA->ODR |= (1U << 8);	//set  c
			GPIOB->ODR &= ~(1U << 5);	//set  d
			GPIOB->ODR |= (1U << 4);	//set  e
			GPIOA->ODR &= ~(1U << 6);	//set  f
			GPIOB->ODR |= (1U << 8);	//set  g

			break;

		case 15: //letter t

			GPIOA->ODR &= ~(1U << 7);	//set  a
			GPIOA->ODR &= ~(1U << 4);	//set  b
			GPIOA->ODR &= ~(1U << 8);	//set  c
			GPIOB->ODR |= (1U << 5);	//set  d
			GPIOB->ODR |= (1U << 4);	//set  e
			GPIOA->ODR |= (1U << 6);	//set  f
			GPIOB->ODR |= (1U << 8);	//set  g

			break;

		case 16: //letter r

			GPIOA->ODR &= ~(1U << 7);	//set  a
			GPIOA->ODR &= ~(1U << 4);	//set  b
			GPIOA->ODR &= ~(1U << 8);	//set  c
			GPIOB->ODR &= ~(1U << 5);	//set  d
			GPIOB->ODR |= (1U << 4);	//set  e
			GPIOA->ODR &= ~(1U << 6);	//set  f
			GPIOB->ODR |= (1U << 8);	//set  g

			break;

		case 17: //letter H

			GPIOA->ODR &= ~(1U << 7);	//set  a
			GPIOA->ODR |= (1U << 4);	//set  b
			GPIOA->ODR |= (1U << 8);	//set  c
			GPIOB->ODR &= ~(1U << 5);	//set  d
			GPIOB->ODR |= (1U << 4);	//set  e
			GPIOA->ODR |= (1U << 6);	//set  f
			GPIOB->ODR |= (1U << 8);	//set  g

			break;

		case 18: // letter q

			GPIOA->ODR |= (1U << 7);	//set  a
			GPIOA->ODR |= (1U << 4);	//set  b
			GPIOA->ODR |= (1U << 8);	//set  c
			GPIOB->ODR &= ~(1U << 5);	//set  d
			GPIOB->ODR &= ~(1U << 4);	//set  e
			GPIOA->ODR |= (1U << 6);	//set  f
			GPIOB->ODR |= (1U << 8);	//set  g

			break;

