arslanalperen/Labs/Source/stm32g0-main/PROJE_2/BSP.c
		case 19://dot symbol

			GPIOA->ODR &= ~(1U << 7);	//set  a
			GPIOA->ODR &= ~(1U << 4);	//set  b
			GPIOA->ODR &= ~(1U << 8);	//set  c
			GPIOB->ODR |= (1U << 5);	//set  d
			GPIOB->ODR &= ~(1U << 4);	//set  e
			GPIOA->ODR &= ~(1U << 6);	//set  f
			GPIOB->ODR &= ~(1U << 8);	//set  g

			break;

		case 20: // letter o

			GPIOA->ODR &= ~(1U << 7);	//set  a
			GPIOA->ODR &= ~(1U << 4);	//set  b
			GPIOA->ODR |= (1U << 8);	//set  c
			GPIOB->ODR |= (1U << 5);	//set  d
			GPIOB->ODR |= (1U << 4);	//set  e
			GPIOA->ODR &= ~(1U << 6);	//set  f
			GPIOB->ODR |= (1U << 8);	//set  g
			break;

		case 21: //letter p
			GPIOA->ODR |= (1U << 7);	//set  a
			GPIOA->ODR |= (1U << 4);	//set  b
			GPIOA->ODR &= ~(1U << 8);	//set  c
			GPIOB->ODR &= ~(1U << 5);	//set  d
			GPIOB->ODR |= (1U << 4);	//set  e
			GPIOA->ODR |= (1U << 6);	//set  f
			GPIOB->ODR |= (1U << 8);	//set  g

			break;

		case 22: //letter d
			GPIOA->ODR &= ~(1U << 7);	//set  a
			GPIOA->ODR |= (1U << 4);	//set  b
			GPIOA->ODR |= (1U << 8);	//set  c
			GPIOB->ODR |= (1U << 5);	//set  d
			GPIOB->ODR |= (1U << 4);	//set  e
			GPIOA->ODR &= ~(1U << 6);	//set  f
			GPIOB->ODR |= (1U << 8);	//set  g

			break;

		case 23: //letter L
			GPIOA->ODR &= ~(1U << 7);	//set  a
			GPIOA->ODR &= ~(1U << 4);	//set  b
			GPIOA->ODR &= ~(1U << 8);	//set  c
			GPIOB->ODR |= (1U << 5);	//set  d
			GPIOB->ODR |= (1U << 4);	//set  e
			GPIOA->ODR |= (1U << 6);	//set  f
			GPIOB->ODR &= ~(1U << 8);	//set  g
			break;

		case 24: // letter I
			GPIOA->ODR &= ~(1U << 7);	//set  a
			GPIOA->ODR &= ~(1U << 4);	//set  b
			GPIOA->ODR &= ~(1U << 8);	//set  c
			GPIOB->ODR &= ~(1U << 5);	//set  d
			GPIOB->ODR |= (1U << 4);	//set  e
			GPIOA->ODR |= (1U << 6);	//set  f
			GPIOB->ODR &= ~(1U << 8);	//set  g

			break;

		case 25: //letter F
			GPIOA->ODR |= (1U << 7);	//set  a
			GPIOA->ODR &= ~(1U << 4);	//set  b
			GPIOA->ODR &= ~(1U << 8);	//set  c
			GPIOB->ODR &= ~(1U << 5);	//set  d
			GPIOB->ODR |= (1U << 4);	//set  e
			GPIOA->ODR |= (1U << 6);	//set  f
			GPIOB->ODR |= (1U << 8);	//set  g
			break;

		case 26://letter u
			GPIOA->ODR &= ~(1U << 7);	//set  a
			GPIOA->ODR &= ~(1U << 4);	//set  b
			GPIOA->ODR |= (1U << 8);	//set  c
			GPIOB->ODR |= (1U << 5);	//set  d
			GPIOB->ODR |= (1U << 4);	//set  e
			GPIOA->ODR &= ~(1U << 6);	//set  f
			GPIOB->ODR &= ~(1U << 8);	//set  g
			break;

		case 27: //letter b

			GPIOA->ODR &= ~(1U << 7);	//set  a
			GPIOA->ODR &= ~(1U << 4);	//set  b
			GPIOA->ODR |= (1U << 8);	//set  c
			GPIOB->ODR |= (1U << 5);	//set  d
			GPIOB->ODR |= (1U << 4);	//set  e
			GPIOA->ODR |= (1U << 6);	//set  f
			GPIOB->ODR |= (1U << 8);	//set  g
			break;
	}

}



void ssd_output(uint32_t x)//special function to print 4 digit numbers
{


		uint32_t dig1;
		uint32_t dig2;
		uint32_t dig3;
		uint32_t dig4;


		dig4 = x % 10U;
		x = x /10U;
		dig3 = x % 10U;
		x = x /10U;
		dig2 = x % 10U;
		x = x /10U;
		dig1 = x % 10U;

	//uint8_t flag = 0;
		int c = 160;

		while(c>0){

			print_digit(dig1);
			GPIOA->ODR &= ~(1U << 11);	//reset  a5
			delay_ms(2);
			GPIOA->ODR |= (1U << 11);	//set  a5

			print_digit(dig2);
			GPIOA->ODR &= ~(1U << 12);	//reset  a4
			delay_ms(2);
			GPIOA->ODR |= (1U << 12);	//set  a4

			print_digit(dig3);
			GPIOA->ODR &= ~(1U << 5);	//reset  a3
			delay_ms(2);
			GPIOA->ODR |= (1U << 5);	//set  a3


			print_digit(dig4);
			GPIOB->ODR &= ~(1U << 9);	//reset  d10
			delay_ms(2);
			GPIOB->ODR |= (1U << 9);	//set  d10

		c--;
		}

	}




void reset_segments() //function for reset the ssd segments
{

	GPIOB->ODR &= ~(1U << 4);	//reset  d12
	GPIOB->ODR &= ~(1U << 5);	//reset  d11
	GPIOA->ODR &= ~(1U << 8);	//reset  d9
	GPIOB->ODR &= ~(1U << 8);	//reset  d8
	GPIOA->ODR &= ~(1U << 4);	//reset  a2
	GPIOA->ODR &= ~(1U << 6);	//reset  a6
	GPIOA->ODR &= ~(1U << 7);	//reset  a7
}


void reset_digits(){//function to reset ssd digits
	GPIOA->ODR |= (1U << 11);	//set  a5
	GPIOA->ODR |= (1U << 12);	//set  a4
	GPIOA->ODR |= (1U << 5);	//set  a3
	GPIOB->ODR |= (1U << 9);	//set  d10

}




/*keypad functions*/

void config_keypad_pins(){
	//assumed that clocks are already opened

	//rows
		setMode('B',6,'O');  //D1 -> row1
		setMode('B',7,'O');  //D0 -> row2
		setMode('A',15,'O'); //D2 -> row3
		setMode('B',1,'O');  //D3 -> row4

		//columns
		setMode('B',2,'I'); //D7 -> column1
		setMode('B',0,'I'); //D6 -> column2
		setMode('A',1,'I'); //A1 -> column3
		setMode('B',3,'I'); //D13 -> column4

		//set input pins pulldown mode for stability
		GPIOB->PUPDR |= (2U << 2*2);
		GPIOB->PUPDR |= (2U << 2*0);
		GPIOA->PUPDR |= (2U << 2*1);
		GPIOB->PUPDR |= (2U << 2*3);

		//set all rows high as initially
		GPIOB->ODR |= (1U << 6);
		GPIOB->ODR |= (1U << 7);
		GPIOA->ODR |= (1U << 15);
		GPIOB->ODR |= (1U << 1);

}

void config_keypad_IRQs(){
//config PA10,PA9,PB0,PA7;

	//RCC-> APBENR2 |= (1U << 0); //enable SYSCFG clock

	//PB2  0-1-2-3 mux
	EXTI->EXTICR[0] |= (1U << 8*2);
	EXTI->RTSR1 |= (1U << 2);
	EXTI->IMR1 |= (1U << 2);



	//PA1  0-1-2-3 mux
	EXTI->EXTICR[0] |= (0U << 8*1);
	EXTI->RTSR1 |= (1U << 1);
	EXTI->IMR1 |= (1U << 1);


	//PA0  0-1-2-3 mux
	EXTI->EXTICR[0] |= (1U << 8*0);
	EXTI->RTSR1 |= (1U << 0);
	EXTI->IMR1 |= (1U << 0);


	//PB3 0-1-2-3 mux
	EXTI->EXTICR[0] |= (1U << 8*3);
	EXTI->RTSR1 |= (1U << 3);
	EXTI->IMR1 |= (1U << 3);


    NVIC_SetPriority(EXTI0_1_IRQn,2);
    NVIC_EnableIRQ(EXTI0_1_IRQn);
	NVIC_SetPriority(EXTI2_3_IRQn,1);
	NVIC_EnableIRQ(EXTI2_3_IRQn);

    /*
    NVIC_SetPriority(EXTI4_15_IRQn,2);
    NVIC_EnableIRQ(EXTI4_15_IRQn);
*/
}


void clear_rows_keypad(){
	//set all rows low
	GPIOB->ODR &= ~(1U << 6);
	GPIOB->ODR &= ~(1U << 7);
	GPIOA->ODR &= ~(1U << 15);
	GPIOB->ODR &= ~(1U << 1);
}


void set_rows_keypad(){
	//set all rows high as initially
	GPIOB->ODR |= (1U << 6);
	GPIOB->ODR |= (1U << 7);
	GPIOA->ODR |= (1U << 15);
	GPIOB->ODR |= (1U << 1);
}




/*COMMUNICATION FUNCTIONS*/
void init_I2C(){
	//PA9 scl
	//PA10 sda


	setMode('A',9,'F');
	setMode('A',10,'F');

	//PA9 alternate function mode
	GPIOA->AFR[1] &= ~(0xFU << 1*4);
	GPIOA->AFR[1] |= (6 << 1*4);

	//PA10 alternate function mode
	GPIOA->AFR[1] &= ~(0xFU << 2*4);
	GPIOA->AFR[1] |= (6 << 2*4);

	//PA9 and PA10 open-drain mode on
	GPIOA->OTYPER |= (1U << 9);
	GPIOA->OTYPER |= (1U << 10);

	//enable I2C clock
	RCC->APBENR1 |= (1U << 21);

	I2C1 ->CR1 = 0; //set control register as zero
	I2C1 ->CR1 |= (1U << 7); // error interrupt ERRIE

