arslanalperen/Labs/Source/stm32g0-main/PROJE_2/BSP.c
	I2C1->CR2 |= (1U << 25);  // AOUTOEND enable
	I2C1->CR2 |= (1U << 14); //NACK enable

	I2C1->TIMINGR |= (3 << 28);		//PRESCALER
	I2C1->TIMINGR |= (0x13 << 0);	//SCLL
	I2C1->TIMINGR |= (0xF << 8);	//SCLH
	I2C1->TIMINGR |= (0x2 << 16);	//SDADEL
	I2C1->TIMINGR |= ((0x4) << 20);	//SCLDEL

	I2C1->CR1 |= (1U << 0);			//PE


	NVIC_SetPriority(I2C1_IRQn,2);	//Set priority to 2
	NVIC_EnableIRQ(I2C1_IRQn);		//Enable NVIC for TIM1
}

void I2C1_IRQHandler(){

	//only enters when error occurs

}

void write_I2C(uint8_t devAddr,uint8_t* data, int Size){	//write function for i2c1 (no address)
	//Send address and register to read
	I2C1->CR2 =0;									//clear register
	I2C1->CR2 |= (uint32_t)(devAddr << 1);			//Send slave address
	I2C1->CR2 |= (uint32_t)(Size << 16); 			//Number of bytes
	I2C1->CR2 |= (1U << 25); 						//AUTOEND
	I2C1->CR2 |= (1U << 13); 						//Generate start

	while(Size){									//while size loop
		while( !(I2C1->ISR & (1 << 1)));			//is flag busy?
		I2C1->TXDR = (*data++);						//send data, data++
		Size--;										//size = size-1;
	}
	/* @Name:	write_I2C
	 *
	 * @Brief:	This function writes data to i2c devices without address.
	 * it writes data faster than other functions. ('with address' functions)
	 * it writes data wherever address pointer points at.
	 */
}
void read_I2C(uint8_t devAddr,uint8_t* data,int Size){		//read function for i2c1 (no address)
	//read Data
	I2C1->CR2 =0;
	I2C1->CR2 |= (uint32_t)(devAddr << 1);
	I2C1->CR2 |= (1U << 10); 						//Read mode
	I2C1->CR2 |= (uint32_t)(Size << 16); 			//Number of bytes
	I2C1->CR2 |= (1U << 25); 						//AUTOEND
	I2C1->CR2 |= (1U << 13); 						//Generate start

	while(Size){
		while( !(I2C1->ISR & (1 << 2)));
		(*data++) = (uint8_t)I2C1->RXDR;
		Size--;
	}
	/* @Name:	read_I2C
	 *
	 * @Brief:	This function reads from i2c devices without address.
	 * it reads data faster than other functions. ('with address' functions)
	 * it reads data wherever address pointer points at.
	 */
}
void write_memory_I2C(uint8_t devAddr,uint16_t memAddr,uint8_t* data, int Size){
	//Send address and register to read
	I2C1->CR2 =0;
	I2C1->CR2 |= (uint32_t)(devAddr << 1);
	I2C1->CR2 |= (uint32_t)(( Size + 2)<< 16); 		//Number of bytes
	I2C1->CR2 |= (1U << 25); 						//AUTOEND
	I2C1->CR2 |= (1U << 13); 						//Generate start

	while(!(I2C1->ISR & (1 << 1)));					//high address
	I2C1->TXDR = (uint32_t)(memAddr >> 8);			//(uint32_t)

	while(!(I2C1->ISR & (1 << 1)));					//low address
	I2C1->TXDR = (uint32_t)(memAddr & 0xFF);		//(uint32_t)

	while(Size){									//while size loop
		while( !(I2C1->ISR & (1 << 1)));			//is flag busy?
		I2C1->TXDR = (*data++);						//sen data, data++
		Size--;										//size = size-1;
	}
	/* @Name:	write_memory_I2C
	 *
	 * @Brief:	This function writes data to i2c devices with 16bit address.
	 * it needs amount of delay for device spesipic ( for EEPROM; 5ms delay)
	 * it divides address into 2 pieces; HIGH ADDr, LOW ADDr
	 */
}
void random_read_I2C(uint8_t devAddr,uint16_t memAddr,uint8_t* data,int Size){
	//Send address and register to read
	I2C1->CR2 =0;
	I2C1->CR2 |= (uint32_t)(devAddr << 1);
	I2C1->CR2 |= (2U << 16); 						//Number of bytes
	I2C1->CR2 |= (1U << 13); 						//Generate start

	while(!(I2C1->ISR & (1 << 1)));
	I2C1->TXDR = (uint32_t)(memAddr >> 8);			//(uint32_t)

	while(!(I2C1->ISR & (1 << 1)));
	I2C1->TXDR = (uint32_t)(memAddr & 0xFF);		//(uint32_t)

	while(!(I2C1->ISR & (1 << 6)));					//transmission complete

	//read Data
	I2C1->CR2 =0;
	I2C1->CR2 |= (uint32_t)(devAddr << 1);
	I2C1->CR2 |= (1U << 10); 						//Read mode
	I2C1->CR2 |= (uint32_t)(Size << 16); 			//Number of bytes
	I2C1->CR2 |= (1U << 25); 						//AUTOEND
	I2C1->CR2 |= (1U << 13); 						//Generate start


	while(Size){
		while( !(I2C1->ISR & (1 << 2)));
		(*data++) = (uint8_t)I2C1->RXDR;
		Size--;
	}
	/* @Name:	random_read_I2C
	 *
	 * @Brief:	This function reads from i2c devices with 16bit address.
	 * it doesn't need delays.
	 * it divides address into 2 pieces; HIGH ADDr, LOW ADDr
	 */
}
